## `resources/dev/ttt-app`
#### Terraform Format and Style 🖌`failure`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

``` Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

module.ecr_api.aws_ecr_repository.ecr: Refreshing state... [id=shd-hoge-api]
module.ecr_api.aws_ecr_lifecycle_policy.lifecycle_policy: Refreshing state... [id=shd-hoge-api]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_dynamodb_table.basic-dynamodb-table will be created
  + resource "aws_dynamodb_table" "basic-dynamodb-table" {
      + arn              = (known after apply)
      + billing_mode     = "PROVISIONED"
      + hash_key         = "UserId"
      + id               = (known after apply)
      + name             = "basic-dynamodb-table"
      + range_key        = "GameTitle"
      + read_capacity    = 1
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + write_capacity   = 1

      + attribute {
          + name = "GameTitle"
          + type = "S"
        }
      + attribute {
          + name = "UserId"
          + type = "S"
        }

      + point_in_time_recovery {
          + enabled = (known after apply)
        }

      + server_side_encryption {
          + enabled     = (known after apply)
          + kms_key_arn = (known after apply)
        }
    }

  # module.ecr_api.aws_ecr_lifecycle_policy.lifecycle_policy must be replaced
-/+ resource "aws_ecr_lifecycle_policy" "lifecycle_policy" {
      ~ id          = "shd-hoge-api" -> (known after apply)
      ~ policy      = jsonencode( # whitespace changes
            {
                rules = [
                    {
                        action       = {
                            type = "expire"
                        }
                        description  = "keep last 30 prd images"
                        rulePriority = 1
                        selection    = {
                            countNumber   = 30
                            countType     = "imageCountMoreThan"
                            tagPrefixList = [
                                "prd-",
                            ]
                            tagStatus     = "tagged"
                        }
                    },
                    {
                        action       = {
                            type = "expire"
                        }
                        description  = "keep last 10 dev images"
                        rulePriority = 5
                        selection    = {
                            countNumber   = 10
                            countType     = "imageCountMoreThan"
                            tagPrefixList = [
                                "dev-",
                            ]
                            tagStatus     = "tagged"
                        }
                    },
                    {
                        action       = {
                            type = "expire"
                        }
                        description  = "keep last 10 untagged images"
                        rulePriority = 10
                        selection    = {
                            countNumber = 10
                            countType   = "imageCountMoreThan"
                            tagStatus   = "untagged"
                        }
                    },
                    {
                        action       = {
                            type = "expire"
                        }
                        description  = "keep last 10 unknown-tagged images"
                        rulePriority = 15
                        selection    = {
                            countNumber = 10
                            countType   = "imageCountMoreThan"
                            tagStatus   = "any"
                        }
                    },
                ]
            }
        )
      ~ registry_id = "859426799760" -> (known after apply)
      ~ repository  = "shd-hoge-api" -> "dev-api" # forces replacement
    }

  # module.ecr_api.aws_ecr_repository.ecr must be replaced
-/+ resource "aws_ecr_repository" "ecr" {
      ~ arn                  = "arn:aws:ecr:ap-northeast-1:859426799760:repository/shd-hoge-api" -> (known after apply)
      ~ id                   = "shd-hoge-api" -> (known after apply)
        image_tag_mutability = "MUTABLE"
      ~ name                 = "shd-hoge-api" -> "dev-api" # forces replacement
      ~ registry_id          = "859426799760" -> (known after apply)
      ~ repository_url       = "859426799760.dkr.ecr.ap-northeast-1.amazonaws.com/shd-hoge-api" -> (known after apply)
      ~ tags                 = {
          ~ "Environment" = "shd" -> "dev"
          ~ "Name"        = "shd-hoge-api" -> "dev-api"
            "Terraform"   = "true"
        }

      - encryption_configuration {
          - encryption_type = "AES256" -> null
        }

        image_scanning_configuration {
            scan_on_push = true
        }
    }

Plan: 3 to add, 0 to change, 2 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

 ```

</details>